export const RANKS: string[] = [
    'ex', 'a', 'a+', 'a++', 'a-', 
    'b', 'b+', 'b++', 'b-', 
    'c', 'c+', 'c++', 'c-', 
    'd', 'd+', 'd++', 'd-', 
    'e', 'e+', 'e++', 'e-'
];
export const PHANTASM_TYPES: string[] = [
    "Против людей", "Против людей (на себя)", "Против людей магический меч", 
    "Против людей секретная техника", "Против людей порядок", "Против армии", 
    "Против армии (лагерь)", "Против армии (на себя)", "Против армии индивидуально", 
    "Против банкетов", "Против зверей", "Против города", 
    "Против страны", "Против преступлений", "Против короны", 
    "Против божественных духов", "Против драконов", "Против зла", 
    "Против крепостей", "Против крепостей (на себя)", "Против ворот", 
    "Против богинь", "Против вторжений", "Против королей", 
    "Против разума", "Против гор", "Против планет", 
    "Против населения", "Против принципа", "Против чистки", 
    "Против самого себя", "Против духов", "Против команды", 
    "Против магии", "Против сокровищ", "Против волн", 
    "Против мудрости", "Против мира", "Барьер", 
    "Концептуальный", "Договор", "Божественный", 
    "Привод", "Крепость", "Лабиринт", 
    "Магическое искусство", "Поэзия", "Пророчество будущего просветления", 
    "Особый прием", "Духовный", "Суицидная атака", "Объявление войны"
];